In [4]:
# BASIC OOP REFRESHER

# create a dog object

class Dog:
    
    # initialize the constructor
    def __init__(self, color, breed, gender, yob, name):
        self.color = color
        self.breed = breed
        self.gender = gender
        self.yob = yob
        self.danger = False
        self.attack = False
        self.name = name
        
    
    # create the methods of the object
    
    def bark(self, intensity = 'l'):
        if intensity == 'l':
            print('WOOOF!')
        elif intensity == 'h':
            print('wooooooooooooooooooooof!!!!!!!!')
    
    def run(self, danger = False):
        if danger:
            self.danger = True
            self.attack = True
            print('running really fast')
        elif danger == False:
            print('RUNNING AND HAVING FUN')
    
    def calm(self):
        if self.attack:
            self.attack = False
            self.danger = False
            print('calming the dog')
        elif self.attack == False:
            print(f'{self.name} is calm already..')

In [5]:
bruno = Dog(color = 'red', breed = 'Rott', gender = 'female', yob = 2015 , name = 'Bruno')

In [10]:
bruno.yob

2015

In [12]:
bruno.bark('h')

wooooooooooooooooooooof!!!!!!!!

In [14]:
bruno.run(True)

running really fast

In [16]:
bruno.calm()

Bruno is calm already..

In [17]:
print(type(bruno))

<class '__main__.Dog'>

### EXPLORATORY DATA ANALYSIS WITH PANDAS AND NUMPY

In [18]:
# import the libraries

import pandas as pd
import numpy as np

In [19]:
# creating a list and a numpy array
age = [12,13,14,25]
age_2 = np.array([12,13,14,25])

In [20]:
print(type(age))
print(type(age_2))

<class 'list'>
<class 'numpy.ndarray'>

In [27]:
a = np.array([[1,2,3],
              [4,5,6],
              [7,8,9]])


print(type(a))

<class 'numpy.ndarray'>

In [22]:
a.shape

(3, 3)

In [26]:
# checking the datatype of element
a.dtype

dtype('<U11')

In [ ]:
# creating pandas dataframe

# 1. from dictionaries or list of lists
# 2. load from local file 
# 3. connect to a database or an API

In [30]:
# method 1 

# create a students table

students = {
    
    'name':['zainab', 'yemi', 'ayo', 'ade', 'wale'],
    'age': [2,3,4,5,6],
    'height' : [11.2,12,32.5,34,12],
    'color':  ['red','red','black','blue','yellow']   
}

students_df = pd.DataFrame(students)

In [31]:
students_df

     name  age  height   color
0  zainab    2    11.2     red
1    yemi    3    12.0     red
2     ayo    4    32.5   black
3     ade    5    34.0    blue
4    wale    6    12.0  yellow

In [33]:
students_list = [
    ['wale', 32, 55.3, 'blue'],
    ['wasiu', 22, 55.3, 'red'],
    ['wale', 32, 55, 'blue'],
    ['sade', 12, 53, 'blue'],
    ['wale', 32, 5.3, 'blue'],
    ['wale', 62, 55.3, 'blue']  
]

columns = ['name', 'age', 'height', 'color']
students_df2 = pd.DataFrame(data= students_list, columns= columns)

In [34]:
students_df2

    name  age  height color
0   wale   32    55.3  blue
1  wasiu   22    55.3   red
2   wale   32    55.0  blue
3   sade   12    53.0  blue
4   wale   32     5.3  blue
5   wale   62    55.3  blue

In [35]:
# METHOD 2 

netflix_df = pd.read_csv('most-popular.csv')

In [37]:
netflix_df.head()

,category,rank,show_title,season_title,hours_viewed_first_91_days,runtime,views_first_91_days
0,Films (English),1,Red Notice,NaN,454200000,1.9667,230900000
1,Films (English),2,Don't Look Up,NaN,408600000,2.3833,171400000
2,Films (English),3,The Adam Project,NaN,281000000,1.7833,157600000
3,Films (English),4,Bird Box,NaN,325300000,2.0667,157400000
4,Films (English),5,The Gray Man,NaN,299500000,2.1500,139300000

In [38]:
food_df = pd.read_csv(r'C:\Users\hp\Desktop\New folder\world_food.csv')

In [39]:
food_df.head(5)

,Entity,Year,Maize Production (tonnes),Rice Production ( tonnes),Yams Production (tonnes),Wheat Production (tonnes),Tomatoes Production (tonnes),Tea Production ( tonnes ),Sweet potatoes Production (tonnes),Sunflower seed Production (tonnes),...,Oranges Production (tonnes),"Peas, dry Production ( tonnes)",Palm oil Production (tonnes),Grapes Production (tonnes),"Coffee, green Production ( tonnes)",Cocoa beans Production (tonnes),"Meat, chicken Production (tonnes)",Bananas Production ( tonnes),Avocados Production (tonnes),Apples Production (tonnes)
0,Afghanistan,1961,700000.0,319000.0,7467702.0,2279000.0,1873812.0,56315.0,3270871.0,12000.0,...,10100.0,232910.0,1131882.0,225000.0,870970.0,835368.0,5600.0,3139079.0,63439.0,15100.0
1,Afghanistan,1962,700000.0,319000.0,7420515.0,2279000.0,2044797.0,61519.0,3562524.0,12800.0,...,10100.0,259412.0,1111006.0,225000.0,883512.0,867170.0,6000.0,3181580.0,65118.0,15100.0
2,Afghanistan,1963,713000.0,319000.0,8479074.0,1947000.0,2096077.0,63596.0,3409916.0,12800.0,...,10100.0,251529.0,1145004.0,225000.0,996674.0,922621.0,6160.0,3304256.0,61760.0,15100.0
3,Afghanistan,1964,720000.0,380000.0,9113779.0,2230000.0,2388264.0,66604.0,3229336.0,12800.0,...,12400.0,247556.0,1160831.0,265000.0,1162048.0,1190061.0,6400.0,3392527.0,62759.0,18400.0
4,Afghanistan,1965,720000.0,380000.0,10067913.0,2282000.0,2559608.0,72418.0,3169104.0,13200.0,...,13700.0,266947.0,1138860.0,287000.0,1075084.0,874245.0,6800.0,3450849.0,66269.0,20400.0

## Assignment

1. create a 15 by 2 numpy array from a python list of lists
2. create an orders dataframe with 10 columns and atleast 10 records using either list of lists or dictionaries
3. download any kaggle dataset and load them using read_csv

### Method 3 - Connecting to Databases

In [1]:
# importing the required libraries 


import mysql.connector
from mysql.connector import Error
from IPython.display import clear_output


import pandas as pd 
import numpy as np

In [2]:
# create a database connection function

def server_connect(host_name, password, user_name):
    connection = None
    try:
        connection = mysql.connector.connect(
            host = host_name,
            passwd = password,
            user = user_name 
        )
    except Error as err:
        print(f'Error:{err}')
    
    return connection

In [3]:
pw = input()
clear_output()
connection = server_connect(host_name='localhost', password= pw, user_name= 'root')

In [4]:
# create a database connection function

def db_connect(host_name, password, user_name, db_name):
    connection = None
    try:
        connection = mysql.connector.connect(
            host = host_name,
            passwd = password,
            user = user_name,
            database = db_name
        )
        print(f'Connected to database {db_name} successfully')
    except Error as err:
        print(f'Error:{err}')
    
    return connection

In [5]:
connection = db_connect(host_name='localhost', password= pw, user_name= 'root', db_name = 'Northwind')

Connected to database Northwind successfully

In [6]:
# reading queries 

def read_query(connection, query):
    cursor = connection.cursor()
    result = None
    try:
        cursor.execute(query)
        result = cursor.fetchall()
        return result
    except Error as err:
        print(f'Error: {err}')

In [7]:
query_1 = '''
select productid, productname, unitprice
from products

'''



results = read_query(connection,query_1)

In [9]:
# define a dataframe creation function

def create_df(data, columns):
    data_list = []
    for result in data:
        result = list(result)
        data_list.append(result)

    df = pd.DataFrame(data= data_list, columns = columns)
    
    return df

In [ ]:
product_df = create_df(data = results, columns= ['id', 'name', 'unitprice'])
product_df

In [ ]:
# convert the program to a class

# query the northwind database by returning all the orders sold, the employees, customer, city, country,product,
# and shipping company involved. Also return the orderdate, shippeddate, requireeddate and freight cost.
# Convert the result set into a proper  pandas dataframe

In [12]:
query_2 = '''

select o.orderid, o.orderdate, o.shippeddate, o.requireddate, o.freight,
    concat_ws(' ', e.firstname, e.lastname) as staff, od.unitprice, od.quantity,
    c.companyname, o.shipcity, o.shipcountry, p.productname, s.companyname
from orders o
join `order details` od on od.orderid = o.orderid
join customers c on c.customerid = o.customerid
join products p on p.productid = od.productid
join shippers s on s.shipperid = o.shipvia
join employees e on e.employeeid = o.employeeid;
'''


columns = ['orderid', 'orderdate', 'shippeddate','requireddate','freight','staff','unitprice','quantity',
           'companyname','city','country','productname','companyname']

results = read_query(connection=connection, query= query_2)

orders_df = create_df(data = results, columns= columns)

In [13]:
orders_df

,orderid,orderdate,shippeddate,requireddate,freight,staff,unitprice,quantity,companyname,city,country,productname,companyname
0,10293,1996-08-29,1996-09-11,1996-09-26,21.1800,Nancy Davolio,50.0000,12,Tortuga Restaurante,Mxico D.F.,Mexico,Carnarvon Tigers,Federal Shipping
1,10293,1996-08-29,1996-09-11,1996-09-26,21.1800,Nancy Davolio,3.6000,10,Tortuga Restaurante,Mxico D.F.,Mexico,Guaran Fantstica,Federal Shipping
2,10293,1996-08-29,1996-09-11,1996-09-26,21.1800,Nancy Davolio,35.1000,5,Tortuga Restaurante,Mxico D.F.,Mexico,Vegie-spread,Federal Shipping
3,10293,1996-08-29,1996-09-11,1996-09-26,21.1800,Nancy Davolio,6.2000,6,Tortuga Restaurante,Mxico D.F.,Mexico,Rhnbru Klosterbier,Federal Shipping
4,10306,1996-09-16,1996-09-23,1996-10-14,7.5600,Nancy Davolio,20.7000,10,Romero y tomillo,Madrid,Spain,Nord-Ost Matjeshering,Federal Shipping
...,...,...,...,...,...,...,...,...,...,...,...,...,...
2150,10829,1998-01-13,1998-01-23,1998-02-10,154.7200,Anne Dodsworth,19.0000,10,Island Trading,Cowes,UK,Chang,Speedy Express
2151,10829,1998-01-13,1998-01-23,1998-02-10,154.7200,Anne Dodsworth,40.0000,20,Island Trading,Cowes,UK,Northwoods Cranberry Sauce,Speedy Express
2152,10829,1998-01-13,1998-01-23,1998-02-10,154.7200,Anne Dodsworth,6.0000,10,Island Trading,Cowes,UK,Konbu,Speedy Express
2153,10829,1998-01-13,1998-01-23,1998-02-10,154.7200,Anne Dodsworth,34.0000,21,Island Trading,Cowes,UK,Camembert Pierrot,Speedy Express
2154,10970,1998-03-24,1998-04-24,1998-04-07,16.1600,Anne Dodsworth,7.0000,40,Blido Comidas preparadas,Madrid,Spain,Filo Mix,Speedy Express

### Exploring Some popular pandas method

In [22]:
# .head method 

orders_df.head()

,orderid,orderdate,shippeddate,requireddate,freight,staff,unitprice,quantity,companyname,city,country,productname,companyname
0,10293,1996-08-29,1996-09-11,1996-09-26,21.1800,Nancy Davolio,50.0000,12,Tortuga Restaurante,Mxico D.F.,Mexico,Carnarvon Tigers,Federal Shipping
1,10293,1996-08-29,1996-09-11,1996-09-26,21.1800,Nancy Davolio,3.6000,10,Tortuga Restaurante,Mxico D.F.,Mexico,Guaran Fantstica,Federal Shipping
2,10293,1996-08-29,1996-09-11,1996-09-26,21.1800,Nancy Davolio,35.1000,5,Tortuga Restaurante,Mxico D.F.,Mexico,Vegie-spread,Federal Shipping
3,10293,1996-08-29,1996-09-11,1996-09-26,21.1800,Nancy Davolio,6.2000,6,Tortuga Restaurante,Mxico D.F.,Mexico,Rhnbru Klosterbier,Federal Shipping
4,10306,1996-09-16,1996-09-23,1996-10-14,7.5600,Nancy Davolio,20.7000,10,Romero y tomillo,Madrid,Spain,Nord-Ost Matjeshering,Federal Shipping

In [23]:
# .tail method 

orders_df.tail(3)

,orderid,orderdate,shippeddate,requireddate,freight,staff,unitprice,quantity,companyname,city,country,productname,companyname
2152,10829,1998-01-13,1998-01-23,1998-02-10,154.7200,Anne Dodsworth,6.0000,10,Island Trading,Cowes,UK,Konbu,Speedy Express
2153,10829,1998-01-13,1998-01-23,1998-02-10,154.7200,Anne Dodsworth,34.0000,21,Island Trading,Cowes,UK,Camembert Pierrot,Speedy Express
2154,10970,1998-03-24,1998-04-24,1998-04-07,16.1600,Anne Dodsworth,7.0000,40,Blido Comidas preparadas,Madrid,Spain,Filo Mix,Speedy Express

In [25]:
# .shape attribute

orders_df.shape

(2155, 13)

In [41]:
# .info method

orders_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2155 entries, 0 to 2154
Data columns (total 13 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   orderid         2155 non-null   int64
 1   orderdate       2155 non-null   datetime64[ns]
 2   shippeddate     2082 non-null   datetime64[ns]
 3   requireddate    2155 non-null   datetime64[ns]
 4   freight         2155 non-null   float64
 5   staff           2155 non-null   object
 6   unitprice       2155 non-null   float64
 7   quantity        2155 non-null   int64
 8   companyname     2155 non-null   object
 9   city            2155 non-null   object
 10  country         2155 non-null   object
 11  companyname     2155 non-null   object
 12  quantity_class  2155 non-null   object
dtypes: datetime64[ns](3), float64(2), int64(2), object(6)
memory usage: 219.0+ KB

In [29]:
# missing value inspection

orders_df.isnull().sum()

orderid          0
orderdate        0
shippeddate     73
requireddate     0
freight          0
staff            0
unitprice        0
quantity         0
companyname      0
city             0
country          0
productname      0
companyname      0
dtype: int64

In [30]:
# basic descriptive statistics

orders_df.describe()

            orderid     quantity
count   2155.000000  2155.000000
mean   10659.375870    23.812993
std      241.378032    19.022047
min    10248.000000     1.000000
25%    10451.000000    10.000000
50%    10657.000000    20.000000
75%    10862.500000    30.000000
max    11077.000000   130.000000

In [33]:
# .drop method

orders_df.drop(columns= ['productname'], inplace= True)

In [ ]:
# .drop method for rows


# single row

orders_df.drop([23])

# multiple rows in a range

rows = list(range(0,10))

orders_df.drop(rows)

In [38]:
# .apply method 

# create a function that classifies quantity to three diff class of youur choice 

def classify(x):
    if x <= 20:
        return 'low'
    elif x <= 30:
        return 'mid'
    else:
        return 'high'
    

orders_df['quantity_class'] = orders_df['quantity'].apply(classify)

In [40]:
# converting unitprice and freight to numbers 
    
orders_df['unitprice'] = orders_df['unitprice'].apply(pd.to_numeric)
orders_df['freight'] = orders_df['freight'].apply(pd.to_numeric)

In [46]:
# convert orderid to strinngs

orders_df.astype({'orderid':'str'}).dtypes

orderid                   object
orderdate         datetime64[ns]
shippeddate       datetime64[ns]
requireddate      datetime64[ns]
freight                  float64
staff                     object
unitprice                float64
quantity                   int64
companyname               object
city                      object
country                   object
companyname               object
quantity_class            object
dtype: object

In [48]:
# value_counts method

orders_df['staff'].value_counts(ascending=True)

Anne Dodsworth      107
Steven Buchanan     117
Michael Suyama      168
Robert King         176
Andrew Fuller       241
Laura Callahan      260
Janet Leverling     321
Nancy Davolio       345
Margaret Peacock    420
Name: staff, dtype: int64

In [52]:
# unique and nunique method

orders_df['city'].unique()

array(['Mxico D.F.', 'Madrid', 'Nantes', 'Albuquerque', 'Brandenburg',
       'Marseille', 'Barquisimeto', 'Warszawa', 'London', 'Boise',
       'Elgin', 'Mnchen', 'rhus', 'Cowes', 'Walla Walla', 'Lyon',
       'Lisboa', 'Campinas', 'Lule', 'Bern', 'Graz', 'Caracas',
       'Sao Paulo', 'Berlin', 'Helsinki', 'Tsawassen', 'Portland',
       'Cunewalde', 'Montral', 'Lander', 'Stavern', 'Colchester',
       'San Cristbal', 'Kln', 'San Francisco', 'Eugene', 'Reggio Emilia',
       'Stuttgart', 'Lille', 'Sevilla', 'Resende', 'Buenos Aires',
       'Bergamo', 'Rio de Janeiro', 'Charleroi', 'I. de Margarita',
       'Aachen', 'Oulu', 'Toulouse', 'Seattle', 'Genve', 'Cork',
       'Anchorage', 'Torino', 'Brcke', 'Barcelona', 'Leipzig', 'Salzburg',
       'Vancouver', 'Reims', 'Mnster', 'Strasbourg', 'Kobenhavn', 'Paris',
       'Versailles', 'Frankfurt a.M.', 'Butte', 'Mannheim', 'Bruxelles',
       'Kirkland'], dtype=object)

In [ ]:
# assignment

# research 10 new pandas methods and use them on our orders_df dataframe or any dataframe of your choice

In [53]:
orders_df.to_csv('orders.csv')